@chrisst here is the two plans 
```
Terraform will perform the following actions:

  # google_project.my_project will be created
  + resource "google_project" "my_project" {
      + auto_create_network = true
      + billing_account     = "wrong_billing_account"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "sunedward-test-1"
      + number              = (known after apply)
      + org_id              = "my_org_id"
      + project_id          = "xxxxxx-test-1"
      + skip_delete         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  # google_project.my_project is tainted, so must be replaced
-/+ resource "google_project" "my_project" {
        auto_create_network = true
      + billing_account     = "corrected_billing_account"
      + folder_id           = (known after apply)
      ~ id                  = "projects/xxxxxx-test-1" -> (known after apply)
      - labels              = {} -> null
        name                = "xxxxxx-test-1"
      ~ number              = "784120170585" -> (known after apply)
        org_id              = "my_org_id"
        project_id          = "xxxxxx-test-1"
      + skip_delete         = (known after apply)
    }
```